src/Tasks/ЗаявкаНаВыполнение/ЗаявкаНаВыполнение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>ЗаявкаНаВыполнение</name>
  <addressing>InformationRegister.АдресацияЗаявокНаВыполнение</addressing>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.АдресатыПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СодержаниеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Исполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>CatalogRef.СтатусЗадачНаВыполнение</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗатраченноеВремя</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Решение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Письма</name>
    <attributes>
      <name>Письмо</name>
      <type>
        <types>DocumentRef.ВходящееПисьмо</types>
        <types>DocumentRef.ИсходящееПисьмо</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВнутренниеКоментарии</name>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Автор</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Получатели</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>Оповещать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <addressingAttributes>
    <name>ТекущийПользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>АдресацияКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>АдресацияИсполнитель</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </addressingAttributes>
  <addressingAttributes>
    <name>АдресацияИнициатор</name>
    <type>
      <types>CatalogRef.АдресатыПочтовыхСообщений</types>
    </type>
  </addressingAttributes>
</mdclass:Task>

src/Documents/ВходящееПисьмо/ВходящееПисьмо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВходящееПисьмо</name>
  <posting>Deny</posting>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМаршрутизации</name>
    <type>
      <types>EnumRef.ВидыМаршрутизацииПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнутреннийЗаголовок</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправки</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПолучения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВложения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторСообщения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Кодировка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерСпособаАдресации</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправительАдресат</name>
    <type>
      <types>CatalogRef.АдресатыПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>Папка</name>
    <type>
      <types>CatalogRef.ПапкиПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>Предмет</name>
    <type>
      <types>CatalogRef.УведомленияПрограммы</types>
      <types>CatalogRef.Проекты</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>CatalogRef.КонтрольныеТочки</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаHTMLХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаПростойТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстПисьмаРазмеченныйТекстХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекста</name>
    <type>
      <types>EnumRef.ТипыТекстовПочтовыхСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОДоставке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьОПрочтении</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УчетнаяЗапись</name>
    <type>
      <types>CatalogRef.УчетныеЗаписиЭлектроннойПочты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>АдресаУведомленияОПрочтении</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьАдрес</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьКонтакт</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
        <types>CatalogRef.Контрагенты</types>
        <types>CatalogRef.ЛичныеАдресаты</types>
        <types>CatalogRef.Пользователи</types>
        <types>CatalogRef.КонтактныеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>УдалитьОтображаемоеИмя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиКопий</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиОтвета</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПолучателиПисьма</name>
    <attributes>
      <name>Адресат</name>
      <type>
        <types>CatalogRef.АдресатыПочтовыхСообщений</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Tasks/ЗаявкаНаВыполнение/Forms/ФормаЗадачи/Module.bsl
&НаКлиенте
Процедура ОтменаВыполнения(Команда)
	ВыполнитьОтмену();
КонецПроцедуры

Процедура ВыполнитьОтмену()
	Объект.Выполнена = ложь;
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если Строка(Объект.Статус) = "Выполнена" Тогда
		СП = Новый СообщениеПользователю;
		СП.Текст = "Статус ""Выполнена"" устанавливается автоматически при выполнении задачи";
		СП.ПутьКДанным = "Объект.Статус";
		СП.Сообщить();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьФайлы()
	
	ТекПозиция = Неопределено;
	Если Элементы.Вложения.ТекущаяСтрока <> Неопределено Тогда
		ТекДанные = Вложения.НайтиПоИдентификатору(Элементы.Вложения.ТекущаяСтрока);
		Если ТекДанные <> Неопределено Тогда
			Если ТекДанные.Свойство("Ссылка")
				И ЗначениеЗаполнено(ТекДанные.Ссылка) Тогда
				ТекПозиция = Новый Структура("Ссылка", ТекДанные.Ссылка);
			ИначеЕсли ТекДанные.Свойство("Представление")
				И ТекДанные.Свойство("Размер") Тогда
				ТекПозиция = Новый Структура("Представление, Размер", ТекДанные.Представление, ТекДанные.Размер);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Вложения.Очистить();
	
	Для каждого Стр из Объект.Письма Цикл
		Если ЗначениеЗаполнено(Стр.Письмо) Тогда
			ФайлыПисьма = ВстроеннаяПочтаСервер.ПолучитьФайлыПисьма(
				Стр.Письмо, // Письмо
				Истина, // ФормироватьРазмерПредставление
				ОтображатьУдаленныеФайлы); // ВключатьПомеченныеНаУдаление
			
			Для каждого ФайлыПисьмаСтрока Из ФайлыПисьма Цикл
                Если ФайлыПисьмаСтрока.Размер > 5000 Тогда
					ВложенияСтрока = Вложения.Добавить();
					ЗаполнитьЗначенияСвойств(ВложенияСтрока, ФайлыПисьмаСтрока);
					Если ВложенияСтрока.ПометкаУдаления Тогда
						ВложенияСтрока.ИндексКартинки = ВложенияСтрока.ИндексКартинки + 1;
					КонецЕсли;
					ВложенияСтрока.Расположение = "Файл";
				КонецЕсли;	
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекПозиция) Тогда
		Если ТипЗнч(ТекПозиция) = Тип("Структура") Тогда
			Строки = Вложения.НайтиСтроки(ТекПозиция);
			Если Строки.Количество() > 0 Тогда
				Элементы.Вложения.ТекущаяСтрока = Строки[0].ПолучитьИдентификатор();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ОтобразитьКоличествоФайловСервер();
	
КонецПроцедуры

&НаСервере
Процедура ОтобразитьКоличествоФайловСервер()
	
	Если Вложения.Количество() > 0 Тогда
		Элементы.ВложенияПредставление.Заголовок = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Файлы (%1)'"),
			Вложения.Количество());
	Иначе
		Элементы.ВложенияПредставление.Заголовок = НСтр("ru = 'Файлы'");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтображатьУдаленныеФайлы = Истина;
	
	Элемент = УсловноеОформление.Элементы.Добавить();
    Элемент.Использование = Истина;
    Элемент.Оформление.УстановитьЗначениеПараметра("Шрифт", Новый Шрифт(,,Истина));
	
    ЭлементУсловия = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.Использование = Истина;
    ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.НеРавно;
    ЭлементУсловия.ЛевоеЗначение = 0;
    ЭлементУсловия.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Письма.НомерСтроки");
	
	ОформляемоеПоле      = Элемент.Поля.Элементы.Добавить();
	ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("Письма");
	
	Если Не РольДоступна("ПолныеПрава") Тогда
	//Если Найти(ПараметрыСеанса.ТекущийПользователь.Наименование,"Завелев") = 0 
	//	И Найти(ПараметрыСеанса.ТекущийПользователь.Наименование,"Балюк") = 0 Тогда
		//ТолькоПросмотр = Истина; 
		//Элементы.АдресацияИнициатор.Доступность = Ложь;
		//Элементы.АдресацияИсполнитель.Доступность = Ложь;
		//Элементы.АдресацияКонтрагент.Доступность = Ложь;
		//Элементы.ВидРабот.Доступность = Ложь;
		//Элементы.Статус.Доступность = Ложь;
		//Элементы.ГруппаВнутренниеКоментарии.Видимость = Ложь;
		//Элементы.ФормаЗаписать.Доступность = Ложь;
		//Элементы.ФормаВыполнить.Доступность = Ложь;
		//Элементы.ФормаОтветить.Доступность = Ложь;
		//Элементы.Закрыть.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ОбновитьФайлы();
	ОбновитьПисьма();
КонецПроцедуры

&НаКлиенте
Процедура ВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьВложение(Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВложение(ФайлСсылка)
	
	ВстроеннаяПочтаКлиент.ОткрытьВложение(ФайлСсылка, УникальныйИдентификатор);
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПисьма()
	
	Дерево = РеквизитФормыВЗначение("Письма");
	Дерево.Строки.Очистить();
	Сч = 1;
	Для каждого Стр из Объект.Письма Цикл
		
		НоваяСтрокаПисьмо = Дерево.Строки.Добавить();
		НоваяСтрокаПисьмо.НомерСтроки = Сч;
		НоваяСтрокаПисьмо.Письмо = Стр.Письмо;
		НоваяСтрокаПисьмо.ИндексКартинки = 0;
		НоваяСтрокаПисьмо.ИндексКартинкиФайл = -1;
		Если ЗначениеЗаполнено(Стр.Письмо) Тогда
			ФайлыПисьма = ВстроеннаяПочтаСервер.ПолучитьФайлыПисьма(
				Стр.Письмо, // Письмо
				Истина, // ФормироватьРазмерПредставление
				ОтображатьУдаленныеФайлы); // ВключатьПомеченныеНаУдаление
			
			Для каждого ФайлыПисьмаСтрока Из ФайлыПисьма Цикл
                Если ФайлыПисьмаСтрока.Размер > 5000 Тогда
					НоваяСтрокаФайл = НоваяСтрокаПисьмо.Строки.Добавить();
					НоваяСтрокаФайл.Письмо = ФайлыПисьмаСтрока.Представление;
					НоваяСтрокаФайл.Файл = ФайлыПисьмаСтрока.Ссылка;
					НоваяСтрокаФайл.ИндексКартинки = -1;
					НоваяСтрокаФайл.ИндексКартинкиФайл = ФайлыПисьмаСтрока.ИндексКартинки;
					Если ФайлыПисьмаСтрока.ПометкаУдаления Тогда
						НоваяСтрокаФайл.ИндексКартинкиФайл = НоваяСтрокаФайл.ИндексКартинкиФайл + 1;
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		
		НоваяСтрокаТекст = НоваяСтрокаПисьмо.Строки.Добавить();
		ТекстПисьма = Стр.Письмо.ТекстПисьмаПростойТекстХранилище.Получить();
		КонецОтвета = Найти(ТекстПисьма,"-----Original Message-----");
		Если КонецОтвета > 0 Тогда 
			ТекстПисьма = Лев(ТекстПисьма,КонецОтвета - 1);
		КонецЕсли;	
		НоваяСтрокаТекст.Письмо = ТекстПисьма;
		НоваяСтрокаТекст.ИндексКартинки = -1;
		НоваяСтрокаТекст.ИндексКартинкиФайл = -1;
		Сч = Сч + 1;
		
	КонецЦикла;	
	ЗначениеВРеквизитФормы(Дерево, "Письма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПисьмаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если Не ПолныеПрава() Тогда
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(Элементы.Письма.ТекущиеДанные.Письмо) = Тип("ДокументСсылка.ВходящееПисьмо") Тогда
		ПараметрыФормы = Новый Структура("Ключ", Элементы.Письма.ТекущиеДанные.Письмо);
		ОткрытьФорму("Документ.ВходящееПисьмо.ФормаОбъекта",ПараметрыФормы);
	ИначеЕсли ЗначениеЗаполнено(Элементы.Письма.ТекущиеДанные.Файл) Тогда
		ОткрытьВложение(Элементы.Письма.ТекущиеДанные.Файл);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Ответить(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;	 
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьТекстЗавершение", ЭтотОбъект);
	ОткрытьФорму("Задача.ЗаявкаНаВыполнение.Форма.ФормаОтвета", , , , , , ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры   

&НаКлиенте
Процедура ДобавитьТекстЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(РезультатЗакрытия) = Тип("Структура") Тогда
		ТекстОтвета = РезультатЗакрытия.ТекстОтвета;
		МассивВложений = РезультатЗакрытия.МассивВложений;
		Если ЗначениеЗаполнено(ТекстОтвета) Или МассивВложений.Количество() > 0 Тогда
			ОтветитьНаСервере(ТекстОтвета, МассивВложений);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		ОтветитьНаСервере(Строка(РезультатЗакрытия), Новый Массив);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьПараметрыЗаполненияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Сообщение = Новый СообщениеПользователю;
	Если Результат = КодВозвратаДиалога.ОК Тогда
		Сообщение.Текст = "В форме нажата стандартная кнопка ОК";
	ИначеЕсли Результат = КодВозвратаДиалога.Пропустить Тогда
		Сообщение.Текст = "В форме нажата стандартная кнопка Пропустить";
	ИначеЕсли Результат = КодВозвратаДиалога.Отмена Тогда
		Сообщение.Текст = "В форме нажата стандартная кнопка Отмена";
	Иначе       
		Сообщение.Текст = "Обработка этой команды в форме не предусмотрена";
	КонецЕсли;
	Сообщение.Сообщить();   
КонецПроцедуры

&НаСервере
Процедура ОтветитьНаСервере(ТекстОтвета, МассивВложений = Неопределено)
	УчетнаяЗапись = Константы.УчетнаяЗаписьПоддержки.Получить();
	
	ПапкаВходящие = РегистрыСведений.ПапкиУчетныхЗаписей.ПолучитьПапку(
		УчетнаяЗапись,
		Перечисления.ВидыПапокПисем.Входящие);
		
	ОтправительАдресат = млкПодпискиНаСобытия.ПолучитьАдресат(ПараметрыСеанса.ТекущийПользователь);
	
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Сообщить("Не заполнена учетная запись для ответа");
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ПапкаВходящие) Тогда
		Сообщить("Не заполнена папка входящих писем в учетной записи");
		Возврат;
	ИначеЕсли НЕ ЗначениеЗаполнено(ОтправительАдресат) Тогда
		Сообщить("Не заполнен адресат текущего пользователя");
		Возврат;
	КонецЕсли;	
	
	ВходящееПисьмо = Документы.ВходящееПисьмо.СоздатьДокумент();
	ВходящееПисьмо.Важность = Перечисления.ВажностьПисем.Обычная;
	ВходящееПисьмо.ВидМаршрутизации = Перечисления.ВидыМаршрутизацииПисем.Внешняя;
	ВходящееПисьмо.Дата = ТекущаяДата();
	ВходящееПисьмо.ДатаОтправки = ТекущаяДата();
	ВходящееПисьмо.ДатаПолучения = ТекущаяДата();
	ВходящееПисьмо.Комментарий = "Ответ создан в заявке на выполнение " + Объект.Номер + " от " + Объект.Дата;
	ВходящееПисьмо.ОтправительАдресат = ОтправительАдресат;
	ВходящееПисьмо.Папка = ПапкаВходящие;
	ВходящееПисьмо.УчетнаяЗапись = УчетнаяЗапись;
	ВходящееПисьмо.Тема = "RE: " + Объект.Тема + " [#" + Объект.Номер + "]";
	ВходящееПисьмо.ТипТекста = Перечисления.ТипыТекстовПочтовыхСообщений.ПростойТекст;
	ВходящееПисьмо.ТекстПисьмаПростойТекстХранилище = Новый ХранилищеЗначения(ТекстОтвета);
	НоваяСтрока = ВходящееПисьмо.ПолучателиПисьма.Добавить();
	НоваяСтрока.Адресат = Константы.АдресатСистемыПоддержки.Получить();
	
	ВходящееПисьмо.Записать();
	
	Если МассивВложений <> Неопределено Тогда
		Для Каждого Вложение Из МассивВложений Цикл
			АдресВХ = Вложение.АдресВХ;
			ИмяФайла = Вложение.ИмяФайла;
			Если ЗначениеЗаполнено(АдресВХ) И ЭтоАдресВременногоХранилища(АдресВХ) Тогда
				ИмяФайлаИнфо = РаботаСоСтроками.РазложитьИмяФайла(ИмяФайла);
				
				ДвоичныеДанныеВложения = ПолучитьИзВременногоХранилища(АдресВХ);
				РазмерФайла = 0;
				Если ТипЗнч(ДвоичныеДанныеВложения) = Тип("ДвоичныеДанные") Тогда
					РазмерФайла = ДвоичныеДанныеВложения.Размер();
				ИначеЕсли ТипЗнч(ДвоичныеДанныеВложения) = Тип("Картинка") Тогда
					ДвоичныеДанныеКартинки = ДвоичныеДанныеВложения.ПолучитьДвоичныеДанные();
					Если ТипЗнч(ДвоичныеДанныеКартинки) = Тип("ДвоичныеДанные") Тогда
						РазмерФайла = ДвоичныеДанныеКартинки.Размер();
						АдресВХ = ПоместитьВоВременноеХранилище(ДвоичныеДанныеКартинки, УникальныйИдентификатор);
					КонецЕсли;
				КонецЕсли;
				
				СведенияОФайле = РаботаСФайламиКлиентСервер.СведенияОФайле("ФайлСВерсией");
				СведенияОФайле.АдресВременногоХранилищаФайла = АдресВХ;
				СведенияОФайле.ИмяБезРасширения = ИмяФайлаИнфо.Имя;
				СведенияОФайле.РасширениеБезТочки = ИмяФайлаИнфо.Расширение;
				СведенияОФайле.Размер = РазмерФайла;
				СведенияОФайле.ВремяИзменения = ТекущаяДатаСеанса();
				СведенияОФайле.ВремяИзмененияУниверсальное = РаботаСФайламиКлиентСервер.ПолучитьУниверсальноеВремя(СведенияОФайле.ВремяИзменения);
				СведенияОФайле.ХранитьВерсии = Ложь;
				
				РаботаСФайламиВызовСервера.СоздатьФайлСВерсией(ВходящееПисьмо.Ссылка, СведенияОФайле);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	//млкПодпискиНаСобытия.ДокументВходящееПисьмоПриЗаписиПриЗаписи(ВходящееПисьмо.Ссылка, Ложь);
	
	Прочитать();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолныеПрава()
	Возврат РольДоступна("ПолныеПрава");
КонецФункции
